app/views/plushkis/_form.html.erb

SELECT "users".* FROM "users" ORDER BY email DESC
---
    <%= f.label :user_id %><br />
    <%= f.collection_select :user_id, User.all, :id, :email %>