app/views/plushkis/index.html.erb

SELECT "infos".* FROM "infos" WHERE "infos"."location" = 3 LIMIT 1
---

<% if Info.where(:location => 4).first %>