app/views/tenders/index.html.erb

SELECT "infos".* FROM "infos" WHERE "infos"."location" = 2 LIMIT 1
---

<% if Info.where(:location => 2).first %>