app/views/users/edit.html.erb

SELECT "cities".* FROM "cities"
---
	    <%= f.label :Город %>
	    <%= f.collection_select :city_id, City.all, :id, :name %>

SELECT "characters".* FROM "characters"
---
	    <%= f.label :Тип_персонажа %>
	    <%= f.collection_select :character_id, Character.all, :id, :name %>

SELECT "professions".* FROM "professions"
---
	    <%= f.label :Профессия %>
	    <%= f.collection_select :profession_id, Profession.all, :id, :name %>

SELECT "missions".* FROM "missions"
---
	    <%= f.label :Призвание %>
	    <%= f.collection_select :mission_id, Mission.all, :id, :name %>