app/views/users/show.html.erb


	<%if @user.funds.where(:taction => 0..99999999).count > 0%>
---
SELECT SUM("funds"."taction") AS sum_id FROM "funds" WHERE "funds"."user_id" = 47 AND ("funds"."taction" BETWEEN -9999999999 AND 0)

<h3>Награды:</h3>
<% @user.rewards.each do |r|%>
---
SELECT "rewards".* FROM "rewards" WHERE "rewards"."user_id" = 47