app/views/pages/home.html.erb

<% if Info.where(:location => 1).first %>
---
SELECT "infos".* FROM "infos" WHERE "infos"."location" = 1 LIMIT 1


	<div style="text-align: center;"><h3>Наши фонды</h3><h2><%=link_to "«Перекач»: $ "+Fund.sum(:taction).to_s, funds_path%></h2></div>
	<div style="text-align: center;">собрано: <strong>$ <%=Fund.where(:taction => 0..99999999).sum(:taction)%></strong> | роздано:<strong>$ <%=Fund.where(:taction => -9999999999..0).sum(:taction).abs%></strong></div>
	<div style="text-align: center;"><h2><%=link_to "«Плюшкин»: $ "+Plushki.sum(:sum).to_s, plushkis_path%></h2></div>
---
SELECT SUM("funds"."taction") AS sum_id FROM "funds" WHERE ("funds"."taction" BETWEEN -9999999999 AND 0)
SELECT SUM("plushkis"."sum") AS sum_id FROM "plushkis"