app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities" ORDER BY users
---
  def index
    @cities = City.all

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."city_id" = 1 ORDER BY level DESC
---
  def show
    @city = City.find(params[:id])
    @users = User.where(:city_id => @city.id)