app/controllers/funds_controller.rb

SELECT "funds".* FROM "funds"
SELECT "users".* FROM "users" ORDER BY email ASC
---
  def index
    @funds = Fund.all
    @users = User.all