app/controllers/pages_controller.rb

  def home
    @users = User.all
    @lastusers = User.find(:all, :order => "created_at DESC", :limit => 14)
    @lastrewards = Reward.find(:all, :order => "created_at DESC", :limit => 7)
    @walls = Wall.limit(15)
---
SELECT "users".* FROM "users" WHERE ("users"."created_at" BETWEEN '2012-01-19' AND '2012-01-20') ORDER BY email ASC
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY email ASC LIMIT 1  [["id", 2]]
SELECT "walls".* FROM "walls" ORDER BY created_at DESC, created_at LIMIT 15

  def gallery
    @useravas = User.where("length(users.avatar) > 10").sort_by{ rand }
---
SELECT "users".* FROM "users" WHERE (length(users.avatar) > 10)