app/controllers/plushkis_controller.rb

  def index
    @plushkis = Plushki.all
---
SELECT "plushkis".* FROM "plushkis"

  def show
    @plushki = Plushki.find(params[:id])
---
SELECT "plushkis".* FROM "plushkis" WHERE "plushkis"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @plushki = Plushki.new(params[:plushki])

    respond_to do |format|
      if @plushki.save
---
INSERT INTO "plushkis" ("comment", "created_at", "sum", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "Ололо"], ["created_at", Fri, 20 Jan 2012 20:28:40 UTC +00:00], ["sum", 666], ["updated_at", Fri, 20 Jan 2012 20:28:40 UTC +00:00], ["user_id", 2]]