app/controllers/tenders_controller.rb

  def index
    @tenders = Tender.all
---
SELECT "tenders".* FROM "tenders"