app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY email ASC LIMIT 1  [["id", "47"]]
---
  def show
    @user = User.find(params[:id])