app/controllers/walls_controller.rb

  def index
    @walls = Wall.all
---
SELECT "walls".* FROM "walls" ORDER BY created_at DESC

  def create
    @wall = Wall.new(params[:wall])
    @wall.user_id = current_user.id
    respond_to do |format|
      if @wall.save
---
INSERT INTO "walls" ("created_at", "post", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 09 Jan 2012 15:01:28 UTC +00:00], ["post", "sd"], ["updated_at", Mon, 09 Jan 2012 15:01:28 UTC +00:00], ["user_id", 2]]