app/views/cities/index.html.erb

SELECT COUNT(*) FROM "users" WHERE "users"."city_id" = 2
---
	<% if current_user && admin_user %>
		<%= link_to city.name, city %> (<%=city.users.count%>)