app/views/cities/show.html.erb


<%City.all.each do |c|%>
---
SELECT "cities".* FROM "cities"