app/views/prizes/show.html.erb

  <b><%= @prize.description %></b> награждаются:<br />
  <% @prize.rewards.each do |r| %>
---
SELECT "rewards".* FROM "rewards" WHERE "rewards"."prize_id" = 1