app/views/funds/index.html.erb

<%if current_user%>
В наличии <strong>$ <%= Fund.sum(:taction) %></strong>, в т.ч. собрано: <strong>$ <%=Fund.where(:taction => 0..99999999).sum(:taction)%></strong> и роздано: <strong>$ <%=Fund.where(:taction => -9999999999..0).sum(:taction).abs%></strong>. Кроме того имеется <strong><%= Fund.sum(:gold) %> золота</strong>.<br />
<h5>Фонд помог в прокачке <strong><%= Fund.where(:comment => "перекач").count %></strong> человекам</h5>
<% if Info.where(:location => 3).first %>
---
SELECT SUM("funds"."taction") AS sum_id FROM "funds" WHERE ("funds"."taction" BETWEEN -9999999999 AND 0)
SELECT "infos".* FROM "infos" WHERE "infos"."location" = 3 LIMIT 1

		<% @users.each do |u| %>
			<%if u.funds.count > 0%>
---
SELECT "funds".* FROM "funds"

			    <td><%= link_to u.email, u %></td>
			    <td><% if u.funds.sum(:taction) < 0 %><div style="color: red;"><%= u.funds.sum(:taction) %></div><%elsif u.funds.sum(:taction) > 0 %><div style="color: green;"><%= u.funds.sum(:taction) %></div><%end%> <% if u.funds.sum(:gold) != 0 %><div style="color: orange;"><%= u.funds.sum(:gold).to_s+" G." %></div><%end%></td>
---
SELECT SUM("funds"."taction") AS sum_id FROM "funds"

  <tr>
    <td><%= link_to User.find(fund.user_id).email, User.find(fund.user_id) %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY email ASC LIMIT 1  [["id", 2]]